nagyjose/DP/Zavodnik_Syst/STM32_WPAN/App/p2p_server_app.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
 * @file    p2p_server_app.c
 * @author  MCD Application Team
 * @brief   peer to peer Server Application
  ******************************************************************************
  */
/* USER CODE END Header */

#include "p2p_server_app.h"
#include "dbg_trace.h"
#include "app_conf.h"
#include "ble.h"
#include "hci_tl.h"
#include "stm32_seq.h"
#include "flash_logger.h"
#include <stdbool.h>
#include "app_ffd_mac_802_15_4_process.h"

// --- NAŠE UNIKÁTNÍ UUID (128-bit) ---
#define COPY_SERVICE_UUID(uuid_struct) { \
  (uuid_struct)[0]=0x19; (uuid_struct)[1]=0xed; (uuid_struct)[2]=0x82; (uuid_struct)[3]=0xae; \
  (uuid_struct)[4]=0xed; (uuid_struct)[5]=0x21; (uuid_struct)[6]=0x4c; (uuid_struct)[7]=0x9d; \
  (uuid_struct)[8]=0x41; (uuid_struct)[9]=0x45; (uuid_struct)[10]=0x22; (uuid_struct)[11]=0x8e; \
  (uuid_struct)[12]=0x40; (uuid_struct)[13]=0xFE; (uuid_struct)[14]=0x00; (uuid_struct)[15]=0x00; }

#define COPY_RX_UUID(uuid_struct) { (uuid_struct)[12]=0x41; (uuid_struct)[13]=0xFE; }
#define COPY_TX_UUID(uuid_struct) { (uuid_struct)[12]=0x42; (uuid_struct)[13]=0xFE; }

static uint16_t OrienteeringServiceHdle;
static uint16_t RxCharHdle;
static uint16_t TxCharHdle;
static uint16_t current_conn_handle = 0xFFFF; // Handle aktuálního spojení
static bool sleep_pending = false;            // Čekáme na slušné odpojení?

// =============================================================================
// SEZNAM HLAVNÍCH BLE PŘÍKAZŮ
// =============================================================================
typedef enum {
    // --- Bezpečnost a Relace ---
    CMD_UNLOCK              = 0x05,
    CMD_LOCK                = 0x06,
    CMD_VERIFY_HASH         = 0x07,

    // --- Čtení dat ---
    CMD_READ_CONFIG         = 0x10,
		CMD_GET_BATTERY         = 0x14, // <--- PŘIDÁNO: Samostatný stav baterie
    CMD_DOWNLOAD_CURRENT    = 0x20,
    CMD_DOWNLOAD_ALL        = 0x21,
    CMD_DOWNLOAD_SPECIFIC   = 0x22,

    // --- Zápis do Konfigurace (Staging) ---
    CMD_STAGE_PARAM         = 0x12,
    CMD_COMMIT_CONFIG       = 0x13,

    // --- Nástroje ---
    CMD_IDENTIFY            = 0x40,
		CMD_SLEEP               = 0x51,  // PŘIDÁNO: Příkaz pro návrat do MAC

    // --- Mazání a Resety ---
    CMD_RESET_CONFIG        = 0x97,
    CMD_RESET_ALL           = 0x98,
    CMD_FORMAT_HISTORY      = 0x99
} BLE_Command_t;

// =============================================================================
// SEZNAM PARAMETRŮ PRO ÚPRAVU KONFIGURACE (Pro příkaz 0x12)
// =============================================================================
typedef enum {
    // --- Vysílané a základní informace ---
    PARAM_BLE_DEVICE_NAME   = 0x01,
    PARAM_DEVICE_TYPE       = 0x02,
    PARAM_DEVICE_ID         = 0x03,
    PARAM_DEVICE_HASH       = 0x04,

    // --- Rozhodovací parametry ---
    PARAM_COOLDOWN_MS       = 0x05,
    PARAM_REQ_HITS          = 0x06,
    PARAM_NUM_HITS          = 0x07,
    PARAM_BUZZER_ONOFF      = 0x08,

    // --- Informace o závodníkovi ---
    PARAM_COMP_NAME         = 0x09,
    PARAM_COMP_NAT          = 0x0A,
    PARAM_COMP_BIRTH_DATE   = 0x0B,
    PARAM_COMP_EMAIL        = 0x0C,
    PARAM_COMP_PHONE        = 0x0D,
    PARAM_COMP_ADDRESS      = 0x0E,
    PARAM_COMP_REGISTRATION = 0x0F,
    PARAM_COMP_IOFID        = 0x10,
    PARAM_COMP_ORISID       = 0x11,
    PARAM_COMP_TEAM_1       = 0x12,
    PARAM_COMP_TEAM_2       = 0x13,
    PARAM_COMP_TEAM_3       = 0x14,

    // --- Dlouhé texty ---
    PARAM_COMP_MEDICAL_INFO = 0x15,
    PARAM_COMP_OTHER_INFO   = 0x16
} Config_Param_t;

extern void Get_ADC_Measurements(int8_t *out_temp, uint16_t *out_batt_mv);

static uint8_t pending_disconnect_action = 0; // 0 = Nic, 1 = SLEEP, 2 = POWER_OFF
static uint8_t DisconnectTimerId;

void Execute_Disconnect_Task(void); // <--- Přidej tento řádek nahoru k definicím

// Callback časovače pouze probudí finální Task
static void DisconnectTimer_Callback(void) {
    UTIL_SEQ_SetTask(1 << CFG_TASK_EXECUTE_DISCONNECT, CFG_SCH_PRIO_0);
}

// =============================================================================
// STAVOVÉ PROMĚNNÉ PRO KRÁJEČ (CHUNKER)
// =============================================================================
static uint8_t *chunk_ptr = NULL;        // Ukazatel na to, co zrovna odesíláme
static uint32_t chunk_rem_len = 0;       // Kolik bajtů nám ještě zbývá odeslat
static uint8_t  chunk_active_cmd = 0;    // Jaký příkaz se zrovna vykonává

#define CHUNK_MAX_SIZE 20 // Maximální velikost jedné rány (BLE MTU to bezpečně snese)

// =============================================================================
// STAVOVÉ PROMĚNNÉ PRO RELACI (SESSION & STAGING)
// =============================================================================
static bool is_unlocked = false;           // Stav zámku (Odemčeno / Zamčeno)
static RunnerConfig_t staged_config;       // RAM kopie konfigurace pro úpravy

// =============================================================================
// KRYPTOGRAFIE (Challenge-Response)
// =============================================================================
static uint32_t current_challenge = 0; // Paměť pro aktuálně vygenerovanou výzvu

// Murmur3 Avalanche Hash (Jednoduchá, ale velmi silná míchací funkce)
static uint32_t Generate_Response(uint32_t challenge, uint32_t pin) {
    uint32_t mix = challenge ^ pin; // Smícháme výzvu s tajným heslem
    mix ^= mix >> 16;
    mix *= 0x85ebca6b;
    mix ^= mix >> 13;
    mix *= 0xc2b2ae35;
    mix ^= mix >> 16;
    return mix; // Výsledný Hash (Response)
}

// =============================================================================
// FUNKCE KRÁJEČE (Volá se asynchronně přes Sequencer)
// =============================================================================
void BLE_Chunker_Task(void)
{
	if (chunk_rem_len == 0) return; // Není co posílat

	// Zjistíme, jestli pošleme plných 200 bajtů, nebo už jen zbytek
	uint16_t send_len = (chunk_rem_len > CHUNK_MAX_SIZE) ? CHUNK_MAX_SIZE : chunk_rem_len;

	// Fyzický pokus o odeslání do fronty Bluetooth rádia
	tBleStatus ret = aci_gatt_update_char_value(OrienteeringServiceHdle, TxCharHdle, 0, send_len, chunk_ptr);

	if (ret == BLE_STATUS_SUCCESS)
	{
		// Paket vložen do vysílače! Posuneme ukazatele dopředu.
		chunk_ptr += send_len;
		chunk_rem_len -= send_len;

		// PŘIDÁNO: Nativní podpora pro Kruhový Buffer (Přetečení)
		if ((uint32_t)chunk_ptr >= (LOGGER_START_ADDR + (LOGGER_MAX_PAGES * LOGGER_PAGE_SIZE))) {
			chunk_ptr = (uint8_t*)LOGGER_START_ADDR;
		}

		if (chunk_rem_len > 0) {
			// Pořád máme data, takže se pokusíme rovnou vypálit další dávku
			UTIL_SEQ_SetTask(1 << CFG_TASK_BLE_CHUNKER, CFG_SCH_PRIO_0);
		} else {
			APP_DBG(">>> BLE CHUNKER: Prenos dokoncen! (CMD: 0x%02X)", chunk_active_cmd);
		}
	}
	else if (ret == BLE_STATUS_INSUFFICIENT_RESOURCES)
	{
		// Fronta rádia je dočasně plná. Nevadí, jdeme spát a počkáme na přerušení (TX_POOL_AVAILABLE)
		// APP_DBG(">>> BLE CHUNKER: Fronta plna, cekam na uvolneni...");
	}
	else
	{
		APP_DBG(">>> BLE CHUNKER: Kriticka chyba odeslani! (Err: 0x%02X)", ret);
	}
}

