nagyjose/DP/Zavodnik_Syst/STM32_WPAN/App/p2p_server_app.c
// -----------------------------------------------------------------------------
// CALLBACK: PARSER - Zde zpracováváme příkazy z Mobilu a zprávy z Rádia
// -----------------------------------------------------------------------------
static SVCCTL_EvtAckStatus_t Tunnel_Event_Handler(void *pckt)
{
	// LOCKDOWN: Pokud se zrovna vypínáme, ignorujeme všechny nové požadavky od mobilu!
	if (pending_disconnect_action != 0) {
		return SVCCTL_EvtNotAck;
	}

	hci_uart_pckt *hci_pckt = (hci_uart_pckt *)pckt;
	hci_event_pckt *event_pckt = (hci_event_pckt*)hci_pckt->data;

	if (hci_pckt->type != HCI_EVENT_PKT_TYPE) return SVCCTL_EvtNotAck;

	if (event_pckt->evt == HCI_VENDOR_SPECIFIC_DEBUG_EVT_CODE)
	{
		evt_blecore_aci *blecore_evt = (evt_blecore_aci*)event_pckt->data;

		switch (blecore_evt->ecode)
		{
			// --- A) ZPRÁVA Z RÁDIA: MÁM MÍSTO, MŮŽEŠ VYSÍLAT ---
			case ACI_GATT_TX_POOL_AVAILABLE_VSEVT_CODE:
				if (chunk_rem_len > 0) {
					// Rádio odeslalo předchozí pakety do éteru a vyprázdnilo frontu. Probudíme Kráječ.
					UTIL_SEQ_SetTask(1 << CFG_TASK_BLE_CHUNKER, CFG_SCH_PRIO_0);
				}
				break;

			// --- B) ZPRÁVA Z MOBILU: UŽIVATEL POSLAL PŘÍKAZ ---
			case ACI_GATT_ATTRIBUTE_MODIFIED_VSEVT_CODE:
			{
				aci_gatt_attribute_modified_event_rp0 *mod = (aci_gatt_attribute_modified_event_rp0*)blecore_evt->data;

				// Zápis do RX Charakteristiky (Ověření Handle)
				if (mod->Attr_Handle == (RxCharHdle + 1))
				{
					BLE_Command_t cmd = (BLE_Command_t)mod->Attr_Data[0];

					// Bezpečnostní pojistka: Kdyby ještě běžel starý přenos, natvrdo ho zrušíme
					chunk_rem_len = 0;

					// =========================================================
					// ROZCESTNÍK PŘÍKAZŮ (COMMAND DICTIONARY)
					// =========================================================
					switch(cmd)
					{
						case CMD_READ_CONFIG: // CMD_READ_CONFIG
							APP_DBG(">>> BLE CMD: READ CONFIG (0x10) - Odesilam %d bajtu", sizeof(RunnerConfig_t));

							// Nabijeme Kráječ celou Flash strukturou Závodníka
							chunk_ptr = (uint8_t*)DEVICE_CONFIG;
							chunk_rem_len = sizeof(RunnerConfig_t);
							chunk_active_cmd = cmd;

							// Zmáčkneme spoušť
							UTIL_SEQ_SetTask(1 << CFG_TASK_BLE_CHUNKER, CFG_SCH_PRIO_0);
							break;

						case CMD_DOWNLOAD_CURRENT: // CMD_DOWNLOAD_CURRENT (Poslední stránka)
						case CMD_DOWNLOAD_ALL: // CMD_DOWNLOAD_ALL (Celá historie)
						case CMD_DOWNLOAD_SPECIFIC: // CMD_DOWNLOAD_SPECIFIC (S parametrem)
						{
							// Přečteme případný druhý bajt (parametr), pokud ho mobil poslal
							uint8_t param = (mod->Attr_Data_Length >= 2) ? mod->Attr_Data[1] : 0;

							uint8_t *data_ptr = NULL;
							uint32_t data_len = 0;

							// Zeptáme se Loggeru, kde data leží a kolik jich je
							Logger_GetDownloadData(cmd, param, &data_ptr, &data_len);

							if (data_len > 0 && data_ptr != NULL) {
								APP_DBG(">>> BLE CMD: Odesilam LOGY (0x%02X) - Delka: %lu bajtu", cmd, data_len);

								// Nabijeme Kráječ a spustíme střelbu!
								chunk_ptr = data_ptr;
								chunk_rem_len = data_len;
								chunk_active_cmd = cmd;
								UTIL_SEQ_SetTask(1 << CFG_TASK_BLE_CHUNKER, CFG_SCH_PRIO_0);
							} else {
								APP_DBG(">>> BLE CMD: Zadne logy k odeslani!");
								// Odpovíme mobilu, že je paměť prázdná
								uint8_t ack_empty[4] = {cmd, 0x00, 0x00, 0x00};
								BLE_Tunnel_Send(ack_empty, 4);
							}
							break;
						}

						// =====================================================
						// SAMOSTATNÉ MĚŘENÍ BATERIE (0x14)
						// =====================================================
						case CMD_GET_BATTERY:
							if (is_unlocked) {
								uint8_t bat_payload[3];

								int8_t teplota_dummy;
								uint16_t bat_mv;
								Get_ADC_Measurements(&teplota_dummy, &bat_mv);

								bat_payload[0] = 0x14;
								bat_payload[1] = (bat_mv >> 8) & 0xFF;
								bat_payload[2] = bat_mv & 0xFF;

								APP_DBG(">>> BLE CMD: GET BATTERY (0x14) - Napeti: %d mV", bat_mv);
								BLE_Tunnel_Send(bat_payload, 3);
							} else {
								uint8_t err_lock[4] = {cmd, 0xAA, 0x00, 0x00}; BLE_Tunnel_Send(err_lock, 4);
							}
							break;

						case CMD_IDENTIFY: // CMD_IDENTIFY (Najdi můj čip)
							APP_DBG(">>> BLE CMD: IDENTIFY (0x40) - Zacinam signalizovat!");

							// 10 vteřin blikání a pípání
							System_Signalize_Start(10);

							// Odpovíme mobilu, že úkol běží
							uint8_t ack_id[4] = {0x40, 0x01, 0x00, 0x00};
							BLE_Tunnel_Send(ack_id, 4);
							break;

						case CMD_SLEEP:
							APP_DBG(">>> BLE CMD: SLEEP (0x51) - Zacinam slusne odpojovani...");
							uint8_t ack_sleep[4] = {0x51, 0x01, 0x00, 0x00};
							BLE_Tunnel_Send(ack_sleep, 4);

							sleep_pending = true;
							pending_disconnect_action = 1; // 1 = Zámek pro SLEEP

							// Necháme rádio dýchat a za 100 ms spustíme finální odpojení
							HW_TS_Start(DisconnectTimerId, (uint32_t)(100 * 1000 / CFG_TS_TICK_VAL));
							break;

						// =====================================================
						// 1A. KROK 1: MOBIL ŽÁDÁ O VÝZVU (0x05)
						// Paket z mobilu: [0x05]
						// =====================================================
						case CMD_UNLOCK:
							// Vygenerujeme náhodné číslo (Využijeme ticky procesoru a UDN čipu)
							current_challenge = HAL_GetTick() ^ DEVICE_CONFIG->magic_word ^ LL_FLASH_GetUDN();

							// Pokud by náhodou vyšla nula (neplatná výzva), změníme ji
							if (current_challenge == 0) current_challenge = 0xDEADBEEF;

							APP_DBG(">>> BLE SECURITY: Generuji vyzvu: %lu", current_challenge);

							// Odešleme výzvu do mobilu (0x05 + 4 bajty výzvy)
							uint8_t ack_chal[5] = {0x05,
																		(current_challenge >> 24) & 0xFF,
																		(current_challenge >> 16) & 0xFF,
																		(current_challenge >> 8)  & 0xFF,
																		 current_challenge        & 0xFF};
							BLE_Tunnel_Send(ack_chal, 5);
							break;

						// =====================================================
						// 1B. KROK 2: MOBIL POSÍLÁ RESPONSE K OVĚŘENÍ (0x07)
						// Paket z mobilu: [0x07] [Resp_1] [Resp_2] [Resp_3] [Resp_4]
						// =====================================================
						case CMD_VERIFY_HASH:
							if (mod->Attr_Data_Length >= 5) {
								// Přečteme Response od mobilu
								uint32_t received_response = ((uint32_t)mod->Attr_Data[1] << 24) |
																						 ((uint32_t)mod->Attr_Data[2] << 16) |
																						 ((uint32_t)mod->Attr_Data[3] << 8)  |
																							(uint32_t)mod->Attr_Data[4];

