nagyjose/DP/Zavodnik_Syst/STM32_WPAN/App/p2p_server_app.c
								// Vypočítáme si, co měl mobil reálně poslat
								uint32_t expected_response = Generate_Response(current_challenge, DEVICE_CONFIG->comp_device_hash);

								// Ověření! (Zároveň kontrolujeme, že výzva byla vůbec vygenerována)
								if (received_response == expected_response && current_challenge != 0) {
									is_unlocked = true;
									current_challenge = 0; // Výzva se smí použít jen jednou! (Obrana proti replay)

									// Zkopírujeme aktuální stav z Flash do naší RAM (Stagingu)
									memcpy(&staged_config, (void*)DEVICE_CONFIG, sizeof(RunnerConfig_t));

									APP_DBG(">>> BLE SECURITY: ODEMCENO! Hash sedi. Relace spustena.");
									uint8_t ack[4] = {0x07, 0x01, 0x00, 0x00}; BLE_Tunnel_Send(ack, 4);
								} else {
									APP_DBG(">>> BLE SECURITY: SPATNA ODPOVED! Utocnik?");
									current_challenge = 0; // Při chybě výzvu okamžitě spálíme
									uint8_t ack[4] = {0x07, 0xEE, 0x00, 0x00}; BLE_Tunnel_Send(ack, 4);
								}
							}
							break;

						// =====================================================
						// 2. ZAMČENÍ RELACE (0x06)
						// Paket: [0x06]
						// =====================================================
						case CMD_LOCK:
							is_unlocked = false;
							memset(&staged_config, 0, sizeof(RunnerConfig_t)); // Bezpečný výmaz RAM
							APP_DBG(">>> BLE SECURITY: ZAMCENO uzivatelem.");
							uint8_t ack_lock[4] = {0x06, 0x01, 0x00, 0x00}; BLE_Tunnel_Send(ack_lock, 4);
							break;

						// =====================================================
						// 3. POSTUPNÉ SKLÁDÁNÍ DO RAM (0x12 - STAGE PARAMETER)
						// Paket: [0x12] [ID] [Offset_H] [Offset_L] [Data...]
						// =====================================================
						case CMD_STAGE_PARAM:
							if (!is_unlocked) {
									APP_DBG(">>> BLE SECURITY: Zamitnuto (ZAMCENO)");
									uint8_t ack[4] = {0x12, 0xEE, 0x00, 0x00}; BLE_Tunnel_Send(ack, 4);
									break;
							}

							if (mod->Attr_Data_Length >= 5) {
								Config_Param_t param_id = (Config_Param_t)mod->Attr_Data[1];
								uint16_t offset = (mod->Attr_Data[2] << 8) | mod->Attr_Data[3];
								uint8_t data_len = mod->Attr_Data_Length - 4;
								uint8_t *payload = &mod->Attr_Data[4];

								APP_DBG(">>> BLE STAGE: Param 0x%02X, Offset: %d, Delka: %d", param_id, offset, data_len);

								// Úprava konkrétních proměnných v RAM (s ochranou délky)
								switch (param_id) {
									// --- 1. ZÁKLADNÍ / VYSÍLANÉ INFORMACE ---
									case PARAM_BLE_DEVICE_NAME: if (offset + data_len <= 32) memcpy(&staged_config.BLE_device_name[offset], payload, data_len); break;
									case PARAM_DEVICE_TYPE: if (data_len >= 1) staged_config.comp_device_type = payload[0]; break;
									case PARAM_DEVICE_ID: if (data_len >= 4) staged_config.comp_device_id = ((uint32_t)payload[0]<<24) | ((uint32_t)payload[1]<<16) | ((uint32_t)payload[2]<<8) | payload[3]; break;
									case PARAM_DEVICE_HASH: if (data_len >= 4) staged_config.comp_device_hash = ((uint32_t)payload[0]<<24) | ((uint32_t)payload[1]<<16) | ((uint32_t)payload[2]<<8) | payload[3]; break;

									// --- 2. ROZHODOVACÍ PARAMETRY ---
									case PARAM_COOLDOWN_MS: if (data_len >= 2) staged_config.cooldown_ms = ((uint16_t)payload[0]<<8) | payload[1]; break;
									case PARAM_REQ_HITS: if (data_len >= 1) staged_config.required_hits = payload[0]; break;
									case PARAM_NUM_HITS: if (data_len >= 1) staged_config.num_hits = payload[0]; break;
									case PARAM_BUZZER_ONOFF: if (data_len >= 1) staged_config.buzzer_onoff = payload[0]; break;

									// --- 3. INFORMACE O ZÁVODNÍKOVI ---
									case PARAM_COMP_NAME: if (offset + data_len <= 64) memcpy(&staged_config.comp_name[offset], payload, data_len); break;
									case PARAM_COMP_NAT: if (offset + data_len <= 4)  memcpy(&staged_config.comp_nationality[offset], payload, data_len); break;
									case PARAM_COMP_BIRTH_DATE: if (data_len >= 4) staged_config.comp_birthday_date = ((uint32_t)payload[0]<<24) | ((uint32_t)payload[1]<<16) | ((uint32_t)payload[2]<<8) | payload[3]; break;
									case PARAM_COMP_EMAIL: if (offset + data_len <= 64) memcpy(&staged_config.comp_email[offset], payload, data_len); break;
									case PARAM_COMP_PHONE: if (offset + data_len <= 16) memcpy(&staged_config.comp_telephone[offset], payload, data_len); break;
									case PARAM_COMP_ADDRESS: if (offset + data_len <= 128) memcpy(&staged_config.comp_address[offset], payload, data_len); break;
									case PARAM_COMP_REGISTRATION: if (offset + data_len <= 8)  memcpy(&staged_config.comp_registration[offset], payload, data_len); break;
									case PARAM_COMP_IOFID: if (data_len >= 4) staged_config.comp_iofid = ((uint32_t)payload[0]<<24) | ((uint32_t)payload[1]<<16) | ((uint32_t)payload[2]<<8) | payload[3]; break;
									case PARAM_COMP_ORISID: if (data_len >= 4) staged_config.comp_orisid = ((uint32_t)payload[0]<<24) | ((uint32_t)payload[1]<<16) | ((uint32_t)payload[2]<<8) | payload[3]; break;
									case PARAM_COMP_TEAM_1: if (offset + data_len <= 64) memcpy(&staged_config.comp_team_1[offset], payload, data_len); break;
									case PARAM_COMP_TEAM_2: if (offset + data_len <= 64) memcpy(&staged_config.comp_team_2[offset], payload, data_len); break;
									case PARAM_COMP_TEAM_3: if (offset + data_len <= 64) memcpy(&staged_config.comp_team_3[offset], payload, data_len); break;

									// --- 4. DLOUHÉ TEXTY (Tady využijeme offset naplno!) ---
									case PARAM_COMP_MEDICAL_INFO: if (offset + data_len <= 512) memcpy(&staged_config.comp_medical_info[offset], payload, data_len); break;
									case PARAM_COMP_OTHER_INFO: if (offset + data_len <= 512) memcpy(&staged_config.comp_other_info[offset], payload, data_len); break;

									default:
										APP_DBG(">>> BLE STAGE: Neznamy parametr (0x%02X)", param_id);
										uint8_t ack_err[4] = {0x12, 0xEE, param_id, 0x00}; BLE_Tunnel_Send(ack_err, 4);
										break;
								}

								uint8_t ack[4] = {0x12, 0x01, param_id, 0x00}; BLE_Tunnel_Send(ack, 4);
							}
							break;

